Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
            #if (ADC_1_CFG3_FILTERTYPE_USED == ADC_1_FILTERTOPOLOGY_LOW_Q)
                        /* Filter-invariant registers */
                ,{ADC_1_UABH_B_SW_CA_IN0_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CA_IN0)}
                ,{ADC_1_UABH_B_SW_CA_IN1_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CA_IN1)}
                ,{ADC_1_UABH_B_SW_CA_TOP_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CA_TOP)}
                ,{ADC_1_UABH_B_SW_CB_IN0_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CB_IN0)}
                ,{ADC_1_UABH_B_SW_CB_IN1_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CB_IN1)}
                ,{ADC_1_UABH_B_SW_CB_TOP_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CB_TOP)}
                ,{ADC_1_UABH_B_SW_CC_IN0_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CC_IN0)}
                ,{ADC_1_UABH_B_SW_CC_IN1_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CC_IN1)}
                ,{ADC_1_UABH_B_SW_CF_BOT_PTR      , ((uint32)ADC_1_UABH_B_LOWQSTAT_SW_CF_BOT)}

                /* Parameter-based registers */
                ,{ADC_1_UABH_B_CAP_CTRL_PTR       , ((uint32)ADC_1_CFG3_UABH_B_LOWQDYN_CAP_CTRL)}
                ,{ADC_1_UABH_B_SW_CC_TOP_PTR      , ((uint32)ADC_1_CFG3_UABH_B_LOWQDYN_SW_CC_TOP)}
                ,{ADC_1_UABH_B_CAP_ABCF_VAL_PTR   , ((uint32)ADC_1_CFG3_UABH_B_LOWQDYN_CAP_ABCF_VAL)}
            #elif (ADC_1_CFG3_FILTERTYPE_USED == ADC_1_FILTERTOPOLOGY_HIGH_Q)
                /* Filter-invariant registers */
                ,{ADC_1_UABH_B_SW_CA_IN0_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CA_IN0)}
                ,{ADC_1_UABH_B_SW_CA_IN1_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CA_IN1)}
                ,{ADC_1_UABH_B_SW_CA_TOP_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CA_TOP)}
                ,{ADC_1_UABH_B_SW_CB_IN0_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CB_IN0)}
                ,{ADC_1_UABH_B_SW_CB_IN1_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CB_IN1)}
                ,{ADC_1_UABH_B_SW_CC_IN0_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CC_IN0)}
                ,{ADC_1_UABH_B_SW_CC_IN1_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CC_IN1)}
                ,{ADC_1_UABH_B_SW_CF_BOT_PTR      , ((uint32)ADC_1_UABH_B_HIGHQSTAT_SW_CF_BOT)}

                /* Parameter-based registers */
                ,{ADC_1_UABH_B_CAP_CTRL_PTR       , ((uint32)ADC_1_CFG3_UABH_B_HIGHQDYN_CAP_CTRL)}
                ,{ADC_1_UABH_B_SW_CB_TOP_PTR      , ((uint32)ADC_1_CFG3_UABH_B_HIGHQDYN_SW_CB_TOP)}
                ,{ADC_1_UABH_B_SW_CC_TOP_PTR      , ((uint32)ADC_1_CFG3_UABH_B_HIGHQDYN_SW_CC_TOP)}
                ,{ADC_1_UABH_B_CAP_ABCF_VAL_PTR   , ((uint32)ADC_1_CFG3_UABH_B_HIGHQDYN_CAP_ABCF_VAL)}
            #endif /* #if (ADC_1_CFG3_FILTERTYPE_USED == ADC_1_FILTERTOPOLOGY_LOW_Q) */
        };

        const static CyUAB_config ADC_1_CFG3_UABH_A_FILTER_config = {
            ADC_1_UABH_A_waveConfig,
            (CyUAB_reg_pair*) ADC_1_CFG3_UABH_A_FILTER_initPairs,
            CyUAB_SHARED_SW_CFG(ADC_1_UABH_A_PARAM_REF_TIED,ADC_1_UABH_A_PARAM_AGND_TIED,
                ADC_1_UABH_A_PARAM_SW_CC,ADC_1_UABH_A_PARAM_SW_BB,ADC_1_UABH_A_PARAM_SW_AA),
            ADC_1_UABH_A_NUM_STEPS,
            (uint8)(ADC_1_UABH_A_ELEMENT_COUNT(ADC_1_CFG3_UABH_A_FILTER_initPairs))
        };

        const static CyUAB_config ADC_1_CFG3_UABH_B_FILTER_config = {
        ADC_1_UABH_B_waveConfig,
        (CyUAB_reg_pair*) ADC_1_CFG3_UABH_B_FILTER_initPairs,
        CyUAB_SHARED_SW_CFG(ADC_1_UABH_B_PARAM_REF_TIED,ADC_1_UABH_B_PARAM_AGND_TIED,
            ADC_1_UABH_B_PARAM_SW_CC,ADC_1_UABH_B_PARAM_SW_BB,ADC_1_UABH_B_PARAM_SW_AA),
        ADC_1_UABH_B_NUM_STEPS,
        (uint8)(ADC_1_UABH_B_ELEMENT_COUNT(ADC_1_CFG3_UABH_B_FILTER_initPairs))
    };
    #endif /* (0u != ADC_1_CFG3_FILTER_PRESENT) */


#endif /* (ADC_1_ANY_CONFIG_USES_FILTER  != 0u)  */

/*******************************************************************************
* Function Name: ADC_1_Start
****************************************************************************//**
*
* \brief Performs all required initialization for this component and enables the
*  power. The power will be set to the appropriate power based on the clock
*  frequency.
*
* \param None
*
* \return None
*
* \sideeffect None
*
* \globalvars
*  \ref ADC_1_initVar (RW)
*
*******************************************************************************/
void ADC_1_Start(void)
{
    if (ADC_1_INIT_VAR_INIT_FLAG != (ADC_1_INIT_VAR_INIT_FLAG & ADC_1_initVar))
    {
        ADC_1_Init();
        ADC_1_initVar |= ADC_1_INIT_VAR_INIT_FLAG;
    }

    ADC_1_Enable();

    return;
}

/*******************************************************************************
* Function Name: ADC_1_StartEx
****************************************************************************//**
*
* \brief This function starts the ADC_1 and sets the Interrupt
* Service Routine to the provided address using the
* ADC_1_IRQ_StartEx() function. Refer to the Interrupt component
* datasheet for more information on the ADC_1_IRQ_StartEx() function.
*
* \param address This is the address of a user defined function for the ISR.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_StartEx(cyisraddress address)
{
    ADC_1_Start();
    ADC_1_IRQ_StartEx(address);
    return;
}

/*******************************************************************************
* Function Name: ADC_1_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the ADC_1_Stop() API to halt conversions. Instead use the
* ADC_1_StopConvert() API. If you use the ADC_1_Stop() API
* to halt conversions then later use the ADC_1_Start() and
* ADC_1_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The ADC_1_StopConvert() API will enable
* the ADC_1 to complete the current scan of channels. After the
* channel scan is complete, the ADC_1 will stop all conversions, which
* can be detected by the use of an ISR or the ADC_1_IsEndConversion()
* flag.
*
*******************************************************************************/
void ADC_1_Stop(void)
{
    #if(0u != ADC_1_ANY_CONFIG_USES_FILTER)
        if((ADC_1_allConfigs[ADC_1_currentConfig].miscConfig
           & ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
           == ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            ADC_1_UABH_A_Stop();
            ADC_1_UABH_B_Stop();
            ADC_1_FILTERAGND2SAR_BUFFER_Stop();
        }
    #endif /* ADC_1_ANY_CONFIG_USES_FILTER != 0u */
    ADC_1_SAR_CTRL_REG &= (uint32)~ADC_1_SAR_CTRL_ENABLED_MSK;
    return;
}

