Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
/* ****************************************************************************
* Function Name: ADC_1_InitConfig
****************************************************************************//*
*
* \brief Configures all of the registers for a given configuration for scanning.
*
* \param
* config: Pointer to the configuration structure
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_InitConfig(const ADC_1_CONFIG_STRUCT *config)
{
    uint32 chNum;
    uint32 tmpRegVal;

    /* If there is an internal SAR clock, set up its divider values. */
    #if (ADC_1_CLOCK_INTERNAL)
        ADC_1_intSarClock_Stop();
        ADC_1_intSarClock_SetFractionalDividerRegister(config->clkDivider, 0u);
        ADC_1_intSarClock_Start();
    #endif /* ADC_1_CLOCK_INTERNAL */

    /* If the current configuration has a filter, set up the UAB clock divider values. */
    #if(0u != ADC_1_ANY_CONFIG_USES_FILTER)
        if((config->miscConfig & ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
            == ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            ADC_1_intUabClock_Stop();
            ADC_1_intUabClock_SetFractionalDividerRegister(config->filterClkDivider, 0u);
            #if defined(ADC_1_cy_psoc4_sar_1__CLOCK_DIV_ID)
                /* If the SAR clock divider ID is known,
                 * start the internal UAB divider aligned to the SAR divider. */
                ADC_1_intUabClock_StartEx(ADC_1_cy_psoc4_sar_1__CLOCK_DIV_ID);
            #else
                /* Otherwise start it unaligned. */
                ADC_1_intUabClock_Start();
            #endif
        }
    #endif /* ADC_1_ANY_CONFIG_USES_FILTER != 0u */

    /* Init SAR and MUX registers */
    /* Enable the SAR internal pump when global pump is enabled */
    ADC_1_SAR_CTRL_REG = config->ctrl
        | (((ADC_1_PUMP_CTRL_REG & ADC_1_PUMP_CTRL_ENABLED) != 0u)
            ? ADC_1_SAR_CTRL_BOOSTPUMP_EN_MSK : 0u);

    ADC_1_SAR_SAMPLE_CTRL_REG = config->sampleCtrl;
    ADC_1_SAR_RANGE_THRES_REG = config->rangeThres;
    ADC_1_SAR_RANGE_COND_REG = config->rangeCond;
    ADC_1_SAR_SAMPLE_TIME01_REG = config->sampleTime01;
    ADC_1_SAR_SAMPLE_TIME23_REG = config->sampleTime23;

    /* Connect Vminus to VSSA when even one channel is single-ended or multiple channels configured */
    if(1u == ADC_1_MUX_SWITCH0_INIT)
    {
        ADC_1_MUX_SWITCH0_REG |= ADC_1_MUX_FW_VSSA_VMINUS;
        /* Set MUX_HW_CTRL_VSSA in MUX_SWITCH_HW_CTRL when multiple channels enabled */
        if(1ul < config->numChannels)
        {
            ADC_1_MUX_SWITCH_HW_CTRL_REG |= ADC_1_MUX_FW_VSSA_VMINUS;
        }
    }

    /* Clear and set interrupt masks */
    ADC_1_SAR_SATURATE_INTR_MASK_REG = 0u;
    ADC_1_SAR_RANGE_INTR_MASK_REG = 0u;
    ADC_1_SAR_SATURATE_INTR_MASK_REG = config->satIntMask;
    ADC_1_SAR_RANGE_INTR_MASK_REG = config->rangeIntMask;
    ADC_1_SAR_INTR_MASK_REG = ADC_1_EOS_MASK;

    for(chNum = 0u; chNum < config->numChannels; chNum++)
    {
        tmpRegVal = (ADC_1_channelsConfig[config->channelBase + chNum]
        & ADC_1_CHANNEL_CONFIG_MASK);

        #if(ADC_1_TOTAL_CHANNELS_NUM > 1)
            tmpRegVal |= ADC_1_InputsPlacement[config->channelBase + chNum];
            /*Non-paired differential channels set NEG_ADDR_EN and clear DIFFERENTIAL_EN */
            if(0u != (ADC_1_InputsPlacement[config->channelBase + chNum] & ADC_1_CHANNEL_CONFIG_NEG_ADDR_EN_MSK))
            {
                tmpRegVal &= ~ADC_1_SAR_CHAN_CONFIG_DIFFERENTIAL_EN_MSK;
            }
        #endif

        CY_SET_REG32((reg32 *)(ADC_1_SAR_CHAN_CONFIG_IND + (uint32)(chNum << 2)), tmpRegVal);
    }

    return;
}

/* ****************************************************************************
* Function Name: ADC_1_SetDFTControl
****************************************************************************//*
*
* \brief Internal function to configure the DFT_CTRL register.
* This register is a non-retention register therefore it resets
* when the SAR block is powered down.
* The register must be configured every time the SAR block is enabled.
*
* \param
* config: Pointer to the configuration structure
*
*******************************************************************************/
static void ADC_1_SetDFTControl(const ADC_1_CONFIG_STRUCT *config)
{
    /* Double the non-overlap delay and latch enable time when using */
    /* internal reference without bypass cap */
    uint32 tmpRegVal = ADC_1_SAR_DFT_CTRL_REG;
    if(((config->ctrl & ADC_1__SAR_CTRL_VREF_BYP_AND_SEL_MSK)
        == ADC_1__INTERNAL1024)
        || ((config->ctrl & ADC_1__SAR_CTRL_VREF_BYP_AND_SEL_MSK)
        == ADC_1__INTERNALVREF))
    {
        tmpRegVal &= ~ADC_1_SAR_DFT_CTRL_DCEN_MSK;
        tmpRegVal |= ADC_1_SAR_DFT_CTRL_DLY_INC_MSK;
    }
    else
    {
        tmpRegVal |= ADC_1_SAR_DFT_CTRL_DCEN_MSK;
        tmpRegVal &= (uint32)~ADC_1_SAR_DFT_CTRL_DLY_INC_MSK;
    }
    ADC_1_SAR_DFT_CTRL_REG = tmpRegVal;
}

/* ****************************************************************************
* Function Name: ADC_1_SelectConfig
****************************************************************************//*
*
* \brief Selects the predefined configuration for scanning. Disables
* and re-enables the SAR and filter (if filter used).
*
* \param config Number of configuration  in the ADC_1.
*
* \param restart Set to 1u to restart the ADC_1 after
* selecting the configuration.
*
*******************************************************************************/
void ADC_1_SelectConfig(uint32 config, uint32 restart)
{
    /* Check whether the configuration number is valid or not */
    if(ADC_1_TOTAL_CONFIGS > config)
    {
        /* Stop the ADC before changing configurations */
        ADC_1_Stop();
        ADC_1_selected = 1u;

        if(0u == ADC_1_initVar)
        {
            ADC_1_Init();
            ADC_1_initVar |= ADC_1_INIT_VAR_INIT_FLAG;
        }
        #if (ADC_1_VREF_ROUTED)
            ADC_1_vrefAMux_DisconnectAll();
        #endif
        ADC_1_InitConfig(&ADC_1_allConfigs[config]);
        #if (ADC_1_VREF_ROUTED)
            ADC_1_vrefAMux_Select((uint8)config);
        #endif
        #if(0u != ADC_1_ANY_CONFIG_USES_FILTER)
            ADC_1_filterVinMux_Select((uint8)config);
            ADC_1_filterInit(config);
        #endif
        ADC_1_SAR_CHAN_EN_REG = ADC_1_allConfigs[config].chanEn;
        ADC_1_SAR_RANGE_INTR_MASK_REG = ADC_1_allConfigs[config].rangeIntMask;
        ADC_1_SAR_SATURATE_INTR_MASK_REG = ADC_1_allConfigs[config].satIntMask;
        ADC_1_currentConfig = config;

