Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
        if(1u == restart)
        {
            /* Restart the ADC */
            ADC_1_Start();

            /* Restart the scan */
            ADC_1_StartConvert();
        }
    }
    return;
}

/*******************************************************************************
* Function Name: ADC_1_StartConvert
****************************************************************************//**
*
* \brief In continuous mode, this API starts the conversion process and it runs
* continuously.

* In Single Shot mode, the function triggers a single scan and
* every scan requires a call of this function. The mode is set with the
* Sample Mode parameter in the customizer. The customizer setting can be
* overridden at run time with the ADC_1_SetConvertMode() function.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_StartConvert(void)
{
    /* Freerunning mode */
    if((ADC_1_SAR_SAMPLE_CTRL_REG
        & ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
        == ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    {
        ADC_1_SAR_SAMPLE_CTRL_REG |= ADC_1_SAR_SAMPLE_CTRL_CONTINUOUS_MSK ;
    }
    else /* Firmware trigger */
    {
        ADC_1_SAR_START_CTRL_REG = ADC_1_SAR_START_CTRL_FW_TRIGGER_MSK;
    }

    return;
}

/*******************************************************************************
* Function Name: ADC_1_StopConvert
****************************************************************************//**
*
* \brief Forces the ADC_1 to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_StopConvert(void)
{
    if((ADC_1_SAR_SAMPLE_CTRL_REG
        & ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
        == ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    {
        ADC_1_SAR_SAMPLE_CTRL_REG &= ~ADC_1_SAR_SAMPLE_CTRL_CONTINUOUS_MSK;

        if((ADC_1_allConfigs[ADC_1_currentConfig].miscConfig
            & ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
            == ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            /* Re-synchronize the Filter if a filter is present */
            ADC_1_Stop();
            ADC_1_Start();
        }
    }

    return;
}
/*******************************************************************************
* Function Name: ADC_1_SetConvertMode
****************************************************************************//**
*
* \brief Sets the conversion mode to either Single-Shot or continuous. This
* function overrides the settings applied in the customizer. Changing
* configurations will restore the values set in the customizer.
*
* \param mode Sets the conversion mode. See table below for details.
* | Options                          | Description                             |
* | :------------------------------- | :-------------------------------------- |
* | ADC_1_SINGLE_SHOT     | Calling the ADC_1_StartConvert() function after setting mode this will trigger a single scan. Sets the SOC signal to be edge sensitive, each edge will trigger a single scan. |
* | ADC_1_CONTINUOUS      | Calling the ADC_1_StartConvert() function after setting this mode trigger continuous scanning. This mode sets the SOC signal to be level sensitive. The ADC_1 will continuously scan while soc is active. |
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_SetConvertMode(uint32 mode)
{
    if(ADC_1_CONTINUOUS == mode)
    {
        ADC_1_SAR_SAMPLE_CTRL_REG |= ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK;
    }
    else
    {
        ADC_1_SAR_SAMPLE_CTRL_REG &= ~ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK;
    }
}
/* ****************************************************************************
* Function Name: ADC_1_IRQ_Enable
****************************************************************************//*
*
* \brief Enables interrupts to occur at the end of a conversion. Global
* interrupts must also be enabled for the ADC_1 interrupts to occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/


/* ****************************************************************************
* Function Name: ADC_1_IRQ_Disable
****************************************************************************//*
*
* \brief Disables end of conversion interrupts.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/


/*******************************************************************************
* Function Name: ADC_1_SetEosMask
****************************************************************************//**
*
* \brief Sets of clears the End of Scan (EOS) interrupt mask.
*
* \param mask 1 to set the mask, 0 to clear the mask.
*
* \return None
*
* \sideeffect All other bits in the INTR register are cleared by this function.
*
*******************************************************************************/
void ADC_1_SetEosMask(uint32 mask)
{
    ADC_1_SAR_INTR_MASK_REG = mask & ADC_1_EOS_MASK;

    return;
}

/* ****************************************************************************
* Function Name: ADC_1_SetChanMask
****************************************************************************//*
*
* \brief Sets enable/disable mask for all channels in current configuration.
*
*
* \param enableMask
*  Channel enable/disable mask.
*
* \sideeffect
*  None.
*
*******************************************************************************/
void ADC_1_SetChanMask(uint32 enableMask)
{
    uint32 chanCount = ADC_1_allConfigs[ADC_1_currentConfig].numChannels;
    enableMask &= (uint32)((uint32)(1ul << chanCount) - 1ul);
    ADC_1_SAR_CHAN_EN_REG = enableMask;
    return;
}

