Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
/*******************************************************************************
* Function Name: ADC_1_IsEndConversion
****************************************************************************//**
*
* \brief Immediately returns the status of the conversion or does not return
* (blocking) until the conversion completes, depending on the retMode parameter.
*
* \param retMode Check conversion return mode. See the following table for
* options.
* | Options                              | Description                             |
* | :-------------------------------     | :-------------------------------------- |
* | ADC_1_RETURN_STATUS       | Immediately returns the conversion status for sequential channels. If the value returned is zero, the conversion is not complete, and this function should be retried until a nonzero result is returned. |
* | ADC_1_WAIT_FOR_RESULT     | Does not return a result until the ADC_1 conversion of all sequential channels is complete. |
*
* \return uint8: If a nonzero value is returned, the last conversion is complete.
* If the returned value is zero, the ADC_1 is still calculating the last result.
*
* \sideeffect This function reads the end of conversion status, and clears it afterward.
*
*******************************************************************************/
uint32 ADC_1_IsEndConversion(uint32 retMode)
{
    uint32 endOfConversion = 0u;
    uint32 wdt = 0x3FFFFFFuL; /* Watchdog timer for blocking while loop */
    if((ADC_1_RETURN_STATUS == retMode) || (ADC_1_WAIT_FOR_RESULT == retMode))
    {
        do
        {
            endOfConversion = ADC_1_SAR_INTR_REG & ADC_1_EOS_MASK;
            wdt--;
        }while(((0u == endOfConversion)
            && (((uint32) retMode & ADC_1_WAIT_FOR_RESULT) != 0u))
            && (0uL != wdt));

        if(0u != endOfConversion)
        {
            /* Clear EOS bit */
            ADC_1_SAR_INTR_REG = ADC_1_EOS_MASK;
        }
    }

    return endOfConversion;
}

/* ****************************************************************************
* Function Name: ADC_1_IsChannelSigned(uint32 chan)
****************************************************************************//*
*
* Determines if the provided channel is in signed format.
*
* \param chan The ADC_1 channel to check.
*
* \return None
*
* \sideeffect None
*
*
*******************************************************************************/
static int32 ADC_1_IsChannelSigned(uint32 chan)
{
    int32 isSigned = 0;
    uint32 chanConfig;

    chanConfig = CY_GET_REG32((reg32 *)(ADC_1_SAR_CHAN_CONFIG_IND + (uint32)(chan << 2u)));
    /* If differential mode */
    if(0u != (chanConfig & ADC_1_CHANNEL_CONFIG_DIFF_ALL_MSK))
    {
        /*If signed differential */
        if((ADC_1_allConfigs[ADC_1_currentConfig].sampleCtrl
            & ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_MSK) != 0u)
        {
            isSigned = 1;
        }
    }
    else
    {
        if((ADC_1_allConfigs[ADC_1_currentConfig].sampleCtrl
            & ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_MSK) != 0u)
        {
            isSigned = 1;
        }
    }
    return isSigned;
}
/*******************************************************************************
* Function Name: ADC_1_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The ADC_1 channel to read the result from. The first
* channel is 0 and the injection channel if enabled is the number of valid
* channels.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
int16 ADC_1_GetResult16(uint32 chan)
{
    uint32 adcResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_1_allConfigs[ADC_1_currentConfig].numChannels);

    if(ADC_1_allConfigs[ADC_1_currentConfig].numChannels > chan)
    {
        adcResult = CY_GET_REG32((reg32 *)(ADC_1_SAR_CHAN_RESULT_IND + (uint32)(chan << 2u))) &
            ADC_1_RESULT_MASK;
    }
    else
    {
        adcResult = 0u;
    }

    return (int16) adcResult;
}

/*******************************************************************************
* Function Name: ADC_1_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The ADC_1 channel to read the result from. The first
* channel is 0 and the injection channel if enabled is the number of valid
* channels.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
int32 ADC_1_GetResult32(uint32 chan)
{
    uint32 adcResult;
    int16 adcResult16;
    int32 finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_1_allConfigs[ADC_1_currentConfig].numChannels);

    if(ADC_1_allConfigs[ADC_1_currentConfig].numChannels > chan)
    {
        adcResult = CY_GET_REG32((reg32 *)(ADC_1_SAR_CHAN_RESULT_IND + (uint32)(chan << 2u))) &
            ADC_1_RESULT_MASK;
    }
    else
    {
        adcResult = 0u;
    }
    /* Sign extend if channel is signed format */
    if(ADC_1_IsChannelSigned(chan) == 1)
    {
        adcResult16 = (int16) adcResult;
        finalResult = (int32) adcResult16;
    }
    else
    {
        finalResult = (int32) adcResult;
    }
    return finalResult;
}

/*******************************************************************************
* Function Name: ADC_1_SetLowLimit
****************************************************************************//**
*
* \brief Sets the low limit parameter for a limit condition.
*
* \param lowLimit The low limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_SetLowLimit(uint32 lowLimit)
{
    ADC_1_SAR_RANGE_THRES_REG &= ~(uint32)(ADC_1_SAR_RANGE_THRES_RANGE_LOW_MSK);
    ADC_1_SAR_RANGE_THRES_REG |= lowLimit & ADC_1_SAR_RANGE_THRES_RANGE_LOW_MSK;
    return;
}

