Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
/*******************************************************************************
* Function Name: ADC_1_CountsTo_Volts
****************************************************************************//**
*
* \brief Converts the ADC output to Volts as a float32. For example, if the ADC
* measured 0.534 volts, the return value would be 0.534.
* The calculation of voltage depends on the contents of ADC_1_offset[],
* ADC_1_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = ADC_1_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = ADC_1_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_1 channel number.
*
* \param adcCounts Result from the ADC_1 conversion.
*
* \return Result in Volts.
*
* \sideeffect None
*
*******************************************************************************/
float32 ADC_1_CountsTo_Volts(uint32 chan, int16 adcCounts)
{
    float32 result_Volts = 0.0f;
    uint32 rawChannel;
    rawChannel = ADC_1_allConfigs[ADC_1_currentConfig].channelBase + chan;

    if((ADC_1_allConfigs[ADC_1_currentConfig].sampleCtrl
        & ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK)
        != ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK)
    {
        adcCounts = ADC_1_RawCounts2Counts(chan, adcCounts);

        result_Volts = ((float32)adcCounts * ADC_1_10V_COUNTS)
            / (float32)ADC_1_countsPer10Volt[rawChannel];
    }
    return result_Volts;
}

/*******************************************************************************
* Function Name: ADC_1_CountsTo_mVolts
****************************************************************************//**
*
* \brief Converts the ADC output to millivolts as an int16. For example, if the ADC
* measured 0.534 volts, the return value would be 534.
* The calculation of voltage depends on the contents of ADC_1_offset[],
* ADC_1_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = ADC_1_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = ADC_1_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_1 channel number.
*
* \param adcCounts Result from the ADC_1 conversion.
*
* \return Result in mV.
*
* \sideeffect None.
*
*******************************************************************************/
int16 ADC_1_CountsTo_mVolts(uint32 chan, int16 adcCounts)
{
    int16 result_mVolts = 0;
    uint32 rawChannel;

    rawChannel = ADC_1_allConfigs[ADC_1_currentConfig].channelBase + chan;

    if((ADC_1_allConfigs[ADC_1_currentConfig].sampleCtrl
        & ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK)
        != ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK)
    {
        adcCounts = ADC_1_RawCounts2Counts(chan, adcCounts);

        result_mVolts = (int16)((((int32)adcCounts * ADC_1_10MV_COUNTS) + ( (adcCounts > 0) ?
                 (ADC_1_countsPer10Volt[rawChannel] / 2)
                : (-(ADC_1_countsPer10Volt[rawChannel] / 2)) ))
                 / ADC_1_countsPer10Volt[rawChannel]);
    }
    return result_mVolts;
}

/*******************************************************************************
* Function Name: ADC_1_CountsTo_uVolts
****************************************************************************//**
*
* \brief Converts the ADC output to microvolts as an int32. For example, if the ADC
* measured 0.534 volts, the return value would be 534000.
* The calculation of voltage depends on the contents of ADC_1_offset[],
* ADC_1_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = ADC_1_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = ADC_1_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_1 channel number.
*
* \param adcCounts Result from the ADC_1 conversion.
*
* \return Result in microvolts.
*
* \sideeffect None
*
*******************************************************************************/
int32 ADC_1_CountsTo_uVolts(uint32 chan, int16 adcCounts)
{
    int64 result_uVolts = 0;
    uint32 rawChannel;
    rawChannel = ADC_1_allConfigs[ADC_1_currentConfig].channelBase + chan;

    if((ADC_1_allConfigs[ADC_1_currentConfig].sampleCtrl
        & ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK)
        != ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK)
    {
        adcCounts = ADC_1_RawCounts2Counts(chan, adcCounts);

        result_uVolts = ((int64)adcCounts * ADC_1_10UV_COUNTS)
            / ADC_1_countsPer10Volt[rawChannel];
    }
    return ( (int32)result_uVolts );
}

#if(0u != ADC_1_ANY_CONFIG_USES_FILTER)

    /*******************************************************************************
    * Function Name: ADC_1_TrimFilterVos
    ****************************************************************************//**
    *
    * \brief Run an algorithm to reduce voltage offset using the UAB's opamp and
    * agnd buffer trim.
    *
    * During trimming, the filter inputs are disconnected from the UAB block,
    * the non-inverting input of both UAB opamps are connected to Agnd,
    * and SAR is used as a comparator.
    *
    * Trimming is done by comparing the filter output with Agnd.
    * The algorithm steps through the Opamp trim codes first and then the
    * Agnd trim codes to find where the filter output crosses Agnd.
    * For each trim code, a blocking delay is used to allow the filter output
    * to settle before reading the comparator status. This delay is equivalent
    * to 9 * tau, where tau is the filter time constant:
    *
    * tau = 1 / (2 * pi * (Fcorner or Bandwidth))
    *
    * The time constant is calculated using the bandwidth for Band pass and
    * Band stop and the corner frequency for Low pass and High pass.
    * The algorithm can check up to 40 different trim codes, but it will typically
    * complete in much less time.
    *
    * Once trimming is complete, the UAB is restored to its original configuration.
    *
    * \Note
    * The ADC conversions must be started and Agnd must be supplied to the
    * component before calling this function.
    *
    *******************************************************************************/
    void ADC_1_TrimFilterVos(void)
    {
        uint32 opampTrim = 0uL;
        uint32 agndTrim = 0uL;
        uint32 compStatus = 0uL;

        ADC_1_SetupComparatorTrim();

        /* Sweep from center to crossing */
        compStatus = ADC_1_SetOpampAndAgndTrim(ADC_1_OPAMP_TRIM_POS_BASE, ADC_1_AGND_TRIM_POS_BASE);
        if (0uL == compStatus)
        {
            opampTrim = ADC_1_RaiseOpampTrimToCrossing(ADC_1_OPAMP_TRIM_POS_BASE);
            agndTrim = ADC_1_RaiseAgndTrimToCrossing(ADC_1_AGND_TRIM_POS_BASE);
            if ((agndTrim == (ADC_1_AGND_TRIM_POS_LIMIT - 1uL))
                && (opampTrim != (ADC_1_OPAMP_TRIM_POS_LIMIT - 1uL)))
            {
                opampTrim = ADC_1_IncOpampTrim(opampTrim);
                (void) ADC_1_SetOpampAndAgndTrim(opampTrim, ADC_1_AGND_TRIM_POS_BASE);
                (void) ADC_1_LowerAgndTrimToCrossing(ADC_1_AGND_TRIM_POS_BASE);
            }
        }
        else
        {
            opampTrim = ADC_1_LowerOpampTrimToCrossing(ADC_1_OPAMP_TRIM_POS_BASE);
            agndTrim = ADC_1_LowerAgndTrimToCrossing(ADC_1_AGND_TRIM_POS_BASE);
            if ((agndTrim == (ADC_1_AGND_TRIM_NEG_LIMIT - 1uL))
                && (opampTrim != (ADC_1_OPAMP_TRIM_NEG_LIMIT - 1uL)))
            {
                opampTrim = ADC_1_DecOpampTrim(opampTrim);
                (void) ADC_1_SetOpampAndAgndTrim(opampTrim, ADC_1_AGND_TRIM_POS_BASE);
                (void) ADC_1_RaiseAgndTrimToCrossing(ADC_1_AGND_TRIM_POS_BASE);
            }
        }

