Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
        ADC_1_UndoComparatorTrimSetup();
    }

    /*******************************************************************************
    * Function Name: ADC_1_SetupComparatorTrim
    ********************************************************************************
    *
    * Make proper connections to being trimming the Agnd buffer
    * and Opamp offset.
    *
    *******************************************************************************/
    static void ADC_1_SetupComparatorTrim(void)
    {
        ADC_1_filterVinMux_Select(ADC_1_FILTER_AMUX_CHANNEL);
    }

    /*******************************************************************************
    * Function Name: ADC_1_UndoComparatorTrimSetup
    ********************************************************************************
    *
    * Undo all changes made in ADC_1_SetupComparatorTrim()
    * to bring the Component back to normal operation.
    *
    *******************************************************************************/
    static void ADC_1_UndoComparatorTrimSetup(void)
    {
        ADC_1_filterVinMux_Select((uint8)ADC_1_currentConfig);
    }

    /*******************************************************************************
    * Function Name: ADC_1_RaiseOpampTrimToCrossing
    ********************************************************************************
    *
    * Step through the Opamp trim codes in increasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_1_RaiseOpampTrimToCrossing(uint32 startTrim)
    {
        uint32 opampTrim;
        uint32 lastOpampTrim;
        uint32 compStatus;

        lastOpampTrim = startTrim;
        for (opampTrim = startTrim;
            opampTrim != ADC_1_OPAMP_TRIM_NEG_LIMIT;
            opampTrim = ADC_1_IncOpampTrim(opampTrim))
        {
            compStatus = ADC_1_SetOpampAndAgndTrim(opampTrim, ADC_1_AGND_TRIM_POS_BASE);
            if (0uL != compStatus)
            {
                (void) ADC_1_SetOpampTrim(lastOpampTrim);
                break;
            }
            lastOpampTrim = opampTrim;
        }

        return lastOpampTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_LowerOpampTrimToCrossing
    ********************************************************************************
    *
    * Step through the Opamp trim codes in decreasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_1_LowerOpampTrimToCrossing(uint32 startTrim)
    {
        uint32 opampTrim;
        uint32 lastOpampTrim;
        uint32 compStatus;

        lastOpampTrim = startTrim;
        for (opampTrim = startTrim;
            opampTrim != ADC_1_OPAMP_TRIM_NEG_LIMIT;
            opampTrim = ADC_1_DecOpampTrim(opampTrim))
        {
            compStatus = ADC_1_SetOpampAndAgndTrim(opampTrim, ADC_1_AGND_TRIM_POS_BASE);
            if (0uL == compStatus)
            {
                (void) ADC_1_SetOpampTrim(lastOpampTrim);
                break;
            }
            lastOpampTrim = opampTrim;
        }

        return lastOpampTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_RaiseAgndTrimToCrossing
    ********************************************************************************
    *
    * Step through the Agnd trim codes in increasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_1_RaiseAgndTrimToCrossing(uint32 startTrim)
    {
        uint32 agndTrim;
        uint32 lastAgndTrim;
        uint32 compStatus;

        lastAgndTrim = startTrim;
        for (agndTrim = startTrim;
            agndTrim != ADC_1_AGND_TRIM_NEG_LIMIT;
            agndTrim = ADC_1_IncAgndTrim(agndTrim))
        {
            compStatus = ADC_1_SetAgndTrim(agndTrim);
            if (0uL != compStatus)
            {
                (void) ADC_1_SetAgndTrim(lastAgndTrim);
                break;
            }
            lastAgndTrim = agndTrim;
        }

        return lastAgndTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_LowerAgndTrimToCrossing
    ********************************************************************************
    *
    * Step through the Agnd trim codes in decreasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_1_LowerAgndTrimToCrossing(uint32 startTrim)
    {
        uint32 agndTrim = startTrim;
        uint32 lastAgndTrim = agndTrim;
        uint32 compStatus = 1uL;

        lastAgndTrim = startTrim;
        for (agndTrim = startTrim;
            agndTrim != ADC_1_AGND_TRIM_NEG_LIMIT;
            agndTrim = ADC_1_DecAgndTrim(agndTrim))
        {
            compStatus = ADC_1_SetAgndTrim(agndTrim);
            if (0uL == compStatus)
            {
                (void) ADC_1_SetAgndTrim(lastAgndTrim);
                break;
            }
            lastAgndTrim = agndTrim;
        }

        return lastAgndTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_SetOpampAndAgndTrim
    ********************************************************************************
    *
    * Write the Agnd and Opamp trim codes and return the comparator status.
    *
    *******************************************************************************/
    static uint32 ADC_1_SetOpampAndAgndTrim(uint32 opampTrim, uint32 agndTrim)
    {
        uint32 trimRegVal = ADC_1_UABH_A_OA_TRIM_OA_REG;
        trimRegVal &= ~(ADC_1_OPAMP_TRIM_MASK << CyUAB_OA_OFFSET_SHIFT);
        trimRegVal |= (opampTrim << CyUAB_OA_OFFSET_SHIFT);
        ADC_1_UABH_A_OA_TRIM_OA_REG = trimRegVal;

        trimRegVal = ADC_1_UABH_A_OA_TRIM_AGND_REG;
        trimRegVal &= ~(ADC_1_AGND_TRIM_MASK << CyUAB_AGND_OFFSET_SHIFT);
        trimRegVal |= (agndTrim << CyUAB_AGND_OFFSET_SHIFT);
        ADC_1_UABH_A_OA_TRIM_AGND_REG = trimRegVal;

        return ADC_1_GetCompStatus();
    }

