Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
    /*******************************************************************************
    * Function Name: ADC_1_SetOpampTrim
    ********************************************************************************
    *
    * Write the Opamp trim code and return the comparator status.
    *
    *******************************************************************************/
    static uint32 ADC_1_SetOpampTrim(uint32 opampTrim)
    {
        uint32 trimRegVal = ADC_1_UABH_A_OA_TRIM_OA_REG;
        trimRegVal &= ~(ADC_1_OPAMP_TRIM_MASK << CyUAB_OA_OFFSET_SHIFT);
        trimRegVal |= (opampTrim << CyUAB_OA_OFFSET_SHIFT);
        ADC_1_UABH_A_OA_TRIM_OA_REG = trimRegVal;

        return ADC_1_GetCompStatus();
    }


    /*******************************************************************************
    * Function Name: ADC_1_SetAgndTrim
    ********************************************************************************
    *
    * Write the Agnd trim code and return the comparator status.
    *
    *******************************************************************************/
    static uint32 ADC_1_SetAgndTrim(uint32 agndTrim)
    {
        uint32 trimRegVal = ADC_1_UABH_A_OA_TRIM_AGND_REG;
        trimRegVal &= ~(ADC_1_AGND_TRIM_MASK << CyUAB_AGND_OFFSET_SHIFT);
        trimRegVal |= (agndTrim << CyUAB_AGND_OFFSET_SHIFT);
        ADC_1_UABH_A_OA_TRIM_AGND_REG = trimRegVal;

        return ADC_1_GetCompStatus();
    }

    /*******************************************************************************
    * Function Name: ADC_1_GetCompStatus
    ********************************************************************************
    *
    * Delays to allow filter to settle before reading the ADC result.
    * Returns 1 if the filter output is greater than AGND, else 0.
    *
    *******************************************************************************/
    static uint32 ADC_1_GetCompStatus(void)
    {
        uint32 compStatus = 0UL;
        int16 zeroCode = 0;

        CyDelayUs(ADC_1_allConfigs[ADC_1_currentConfig].filterTrimDelay);

        /*If unsigned differential */
        if((ADC_1_allConfigs[ADC_1_currentConfig].sampleCtrl
            & ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_MSK) == 0U)
        {
            zeroCode = 0x800;
        }

        if (ADC_1_GetResult16(ADC_1_FILTER_ADC_CHANNEL) < zeroCode)
        {
            compStatus = 1UL;
        }

        return compStatus;
    }

    /*******************************************************************************
    * Function Name: ADC_1_IncOpampTrim
    ********************************************************************************
    *
    * Increments the Opamp trim code by one. Note that Opamp trim code is
    * a 4-bit sign-magnitude value.
    *
    * Skips OPAMP_TRIM_NEG_BASE because it is the same as POS_BASE.
    *
    *******************************************************************************/
    /* Skips OPAMP_TRIM_NEG_BASE because it is the same as POS_BASE. */
    static uint32 ADC_1_IncOpampTrim(uint32 trim)
    {

        if (trim < (ADC_1_OPAMP_TRIM_POS_LIMIT - 1uL))
        {
            trim = trim + 1uL;
        }
        else if ((ADC_1_OPAMP_TRIM_POS_LIMIT - 1uL) == trim)
        {
            trim = ADC_1_OPAMP_TRIM_NEG_LIMIT;
        }
        else if (trim <= (ADC_1_OPAMP_TRIM_NEG_BASE + 1uL))
        {
            trim = ADC_1_OPAMP_TRIM_POS_BASE;
        }
        else
        {
            trim = trim - 1uL;
        }

        return trim;
    }


    /*******************************************************************************
    * Function Name: ADC_1_DecOpampTrim
    ********************************************************************************
    *
    * Decrements the Opamp trim code by one. Note that Opamp trim code is
    * a 4-bit sign-magnitude value.
    *
    * Skips OPAMP_TRIM_NEG_BASE because it is the same as POS_BASE.
    *
    *******************************************************************************/
    static uint32 ADC_1_DecOpampTrim(uint32 trim)
    {

        if (ADC_1_OPAMP_TRIM_POS_BASE == trim)
        {
            trim = ADC_1_OPAMP_TRIM_NEG_BASE + 1uL;
        }
        else if (trim < ADC_1_OPAMP_TRIM_POS_LIMIT)
        {
            trim = trim - 1uL;
        }
        else if (trim < ADC_1_OPAMP_TRIM_NEG_LIMIT)
        {
            trim = trim + 1uL;
        }
        else
        {
            trim = ADC_1_OPAMP_TRIM_POS_LIMIT - 1uL;
        }

        return trim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_IncAgndTrim
    ********************************************************************************
    *
    * Increments the Agnd trim code by one. Note that Agnd trim code is
    * a 5-bit sign-magnitude value.
    *
    * Skips AGND_TRIM_NEG_BASE because it is the same as POS_BASE.
    *
    *******************************************************************************/
    static uint32 ADC_1_IncAgndTrim(uint32 trim)
    {

        if (trim < (ADC_1_AGND_TRIM_POS_LIMIT - 1uL))
        {
            trim = trim + 1uL;
        }
        else if ((ADC_1_AGND_TRIM_POS_LIMIT - 1uL) == trim)
        {
            trim = ADC_1_AGND_TRIM_NEG_LIMIT;
        }
        else if (trim <= (ADC_1_AGND_TRIM_NEG_BASE + 1uL))
        {
            trim = ADC_1_AGND_TRIM_POS_BASE;
        }
        else
        {
            trim = trim - 1uL;
        }

        return trim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_DecAgndTrim
    ********************************************************************************
    *
    * Decrements the Agnd trim code by one. Note that Agnd trim code is
    * a 5-bit sign-magnitude value.
    *
    * Skips AGND_TRIM_NEG_BASE because it is the same as POS_BASE.
    *
    *******************************************************************************/
    static uint32 ADC_1_DecAgndTrim(uint32 trim)
    {

        if (trim == ADC_1_AGND_TRIM_POS_BASE)
        {
            trim = ADC_1_AGND_TRIM_NEG_BASE + 1uL;
        }
        else if (trim < ADC_1_AGND_TRIM_POS_LIMIT)
        {
            trim = trim - 1uL;
        }
        else if (trim < ADC_1_AGND_TRIM_NEG_LIMIT)
        {
            trim = trim + 1uL;
        }
        else
        {
            trim = ADC_1_AGND_TRIM_POS_LIMIT - 1uL;
        }

