Conrad-Rowling/Li-CellTesting_Script/PSOC4_Main/PSOC4_Main.cydsn/codegentemp/ADC_1.c
        return trim;
    }

    /*******************************************************************************
    * Function Name: ADC_1_filterInit
    ********************************************************************************
    *
    * Initializes the UAB halves and the CTB buffer between the AGND and the SAR.
    *
    *******************************************************************************/
    void ADC_1_filterInit(uint32 configNum)
    {
        /* Configure the common filter settings if any configuration filters */
        switch (configNum)
        {
            #if (0u != ADC_1_CFG0_FILTER_PRESENT)
            case 0u:
                ADC_1_UABH_A_Init(&ADC_1_CFG0_UABH_A_FILTER_config);
                ADC_1_UABH_B_Init(&ADC_1_CFG0_UABH_B_FILTER_config);
            break;
            #endif
            #if (0u != ADC_1_CFG1_FILTER_PRESENT)
            case 1u:
                ADC_1_UABH_A_Init(&ADC_1_CFG1_UABH_A_FILTER_config);
                ADC_1_UABH_B_Init(&ADC_1_CFG1_UABH_B_FILTER_config);
            break;
            #endif
            #if (0u != ADC_1_CFG2_FILTER_PRESENT)
            case 2u:
                ADC_1_UABH_A_Init(&ADC_1_CFG2_UABH_A_FILTER_config);
                ADC_1_UABH_B_Init(&ADC_1_CFG2_UABH_B_FILTER_config);
            break;
            #endif
            #if (0u != ADC_1_CFG3_FILTER_PRESENT)
            case 3u:
                ADC_1_UABH_A_Init(&ADC_1_CFG3_UABH_A_FILTER_config);
                ADC_1_UABH_B_Init(&ADC_1_CFG3_UABH_B_FILTER_config);
            break;
            #endif
            default:
            break;
        }

        ADC_1_FILTERAGND2SAR_BUFFER_Init();
    }
#endif /* ADC_1_ANY_CONFIG_USES_FILTER != 0u */


/* ****************************************************************************
* Function Name: ADC_1_Init
****************************************************************************//*
*
* \brief Initialize the component according to parameters defined in the
* customizer.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_1_Init(void)
{
    uint32 chNum = 0ul;
    uint32 configNum = 0u;
    int32 counts;

    if(0u == ADC_1_initVar)
    {
        /* Set offset and countsPer10Volt for all channels */
        for(chNum = 0ul; chNum < ADC_1_TOTAL_CHANNELS_NUM; chNum++)
        {
            if((ADC_1_channelsConfig[chNum] & ADC_1_SAR_CHAN_CONFIG_RESOLUTION_MSK) != 0u)
            {
                if((ADC_1_allConfigs[configNum].sampleCtrl
                    & ADC_1_SAR_SAMPLE_CTRL_SUB_RESOLUTION_MSK)
                    == ADC_1_SUB_RESOLUTION_10B)
                {
                    counts = (int32) ADC_1_SAR_WRK_MAX_10BIT;
                }
                else
                {
                    counts = (int32) ADC_1_SAR_WRK_MAX_8BIT;
                }
            }
            else
            {
               counts = (int32)ADC_1_SAR_WRK_MAX_12BIT;
            }

            /* Single Ended Channel */
            if((ADC_1_channelsConfig[chNum] & ADC_1_SAR_CHAN_CONFIG_DIFFERENTIAL_EN_MSK) == 0u)
            {
                if(((ADC_1_allConfigs[configNum].sampleCtrl
                    & ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_MSK)
                    == ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_MSK) &&
                    ((ADC_1_allConfigs[configNum].ctrl & ADC_1_SAR_CTRL_NEG_SEL_MSK)
                    == ADC_1_NEG_VREF_SHIFTED))
                {
                    /* Set offset to the minus half scale to convert results to unsigned format */
                    ADC_1_offset[chNum] = (int16)(counts / -2);
                }
                else
                {
                    ADC_1_offset[chNum] = 0;
                }

            }
            else    /* Differential channel */
            {
                ADC_1_offset[chNum] = 0;
            }

            /* Calculate gain in counts per 10 volts with rounding */
            ADC_1_countsPer10Volt[chNum] = (int16)(((counts * ADC_1_10MV_COUNTS) \
                            + ADC_1_allConfigs[configNum].vrefMvValue) \
                            / (ADC_1_allConfigs[configNum].vrefMvValue * 2));

            /* Increment configuration number after rolling over to the next configuration*/
            if((ADC_1_allConfigs[configNum].channelBase
                + (ADC_1_allConfigs[configNum].numChannels - 1uL)) == chNum)
            {
                configNum++;
            }
        } /* for(chNum = 0ul; chNum < ADC_1_TOTAL_CHANNELS_NUM; chNum++) */

        /* Start and set interrupt vector */
        CyIntSetPriority(ADC_1_INTC_NUMBER, ADC_1_INTC_PRIOR_NUMBER);
        (void)CyIntSetVector(ADC_1_INTC_NUMBER, &ADC_1_ISR);

        /* Initialize configuration zero if SelectConfig has not been called */
        if(0u == ADC_1_selected)
        {
            ADC_1_selected = 1u;
            configNum = 0u;
            /* Change Vref selection if is was routed by Creator. Break. */
            #if (ADC_1_VREF_ROUTED)
                ADC_1_vrefAMux_DisconnectAll();
            #endif
            ADC_1_InitConfig(&ADC_1_allConfigs[configNum]);
            /* Change Vref selection if is was routed by Creator. Make. */
            #if (ADC_1_VREF_ROUTED)
                ADC_1_vrefAMux_Select((uint8)configNum);
            #endif
            ADC_1_SAR_CHAN_EN_REG = ADC_1_allConfigs[configNum].chanEn;
            #if(0u != ADC_1_ANY_CONFIG_USES_FILTER)
                ADC_1_filterVinMux_Select((uint8)configNum);
                ADC_1_filterInit(configNum);
            #endif
        }
    }
    return;
}


/* ****************************************************************************
* Function Name: ADC_1_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
void ADC_1_Enable(void)
{

    #if(0u != ADC_1_ANY_CONFIG_USES_FILTER)
        if((ADC_1_allConfigs[ADC_1_currentConfig].miscConfig
            & ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
            == ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            ADC_1_FILTERAGND2SAR_BUFFER_Enable();
            ADC_1_UABH_A_Enable();
            ADC_1_UABH_B_Enable();
            ADC_1_UABH_B_Run(1u);
            ADC_1_UABH_A_Run(1u);
        }
    #endif /* ADC_1_ANY_CONFIG_USES_FILTER != 0u */

    if (0u == (ADC_1_SAR_CTRL_REG & ADC_1_SAR_CTRL_ENABLED_MSK))
    {
        while (0u != (ADC_1_SAR_STATUS_REG & ADC_1_BUSY_MSK))
        {
            /* wait for SAR to go idle to avoid deadlock */
        }

        ADC_1_SAR_CTRL_REG |= ADC_1_SAR_CTRL_ENABLED_MSK;

        /* The block is ready to use 10 us after the enable signal is set high. */
        CyDelayUs(ADC_1_10US_DELAY);
    }

    /* Must set the DFT_CTRL register after enabling the SAR as it is a non-retention register. */
    ADC_1_SetDFTControl(&ADC_1_allConfigs[ADC_1_currentConfig]);

    return;
}


/* [] END OF FILE */
